import { expect } from "earl";
import { formatText, type FontName } from "./fancyText";

// Useful pangrams:
const LLATIN = "sphinx of black quartz, judge my vow!";
const ULATIN = "SPHINX OF BLACK QUARTZ, JUDGE MY VOW!";
const LGREEK = "υπ∂ϱϰβφεδϕοιρλϑςκνχξηωζμσατγϵϖψθ";
const UGREEK = "ΖΧΚΝΔΗΡΨΩΥΠΕΘΙΤΣΓΑΟΞ∇ΦΒϴΜΛ";
const DIGIT = "3.14159265358979323846264338327950";

describe("Unicode Scripts", function () {
  it("SerifBold (bb)", function () {
    testFont(
      "bb",
      "𝐒𝐏𝐇𝐈𝐍𝐗 𝐎𝐅 𝐁𝐋𝐀𝐂𝐊 𝐐𝐔𝐀𝐑𝐓𝐙, 𝐉𝐔𝐃𝐆𝐄 𝐌𝐘 𝐕𝐎𝐖!",
      "𝐬𝐩𝐡𝐢𝐧𝐱 𝐨𝐟 𝐛𝐥𝐚𝐜𝐤 𝐪𝐮𝐚𝐫𝐭𝐳, 𝐣𝐮𝐝𝐠𝐞 𝐦𝐲 𝐯𝐨𝐰!",
      "𝚭𝚾𝚱𝚴𝚫𝚮𝚸𝚿𝛀𝚼𝚷𝚬𝚯𝚰𝚻𝚺𝚪𝚨𝚶𝚵𝛁𝚽𝚩𝚹𝚳𝚲",
      "𝛖𝛑𝛛𝛠𝛞𝛃𝛗𝛆𝛅𝛟𝛐𝛊𝛒𝛌𝛝𝛓𝛋𝛎𝛘𝛏𝛈𝛚𝛇𝛍𝛔𝛂𝛕𝛄𝛜𝛡𝛙𝛉",
      "𝟑.𝟏𝟒𝟏𝟓𝟗𝟐𝟔𝟓𝟑𝟓𝟖𝟗𝟕𝟗𝟑𝟐𝟑𝟖𝟒𝟔𝟐𝟔𝟒𝟑𝟑𝟖𝟑𝟐𝟕𝟗𝟓𝟎",
    );
  });

  it("DoubleStruck (bbb)", function () {
    testFont(
      "bbb",
      "𝕊ℙℍ𝕀ℕ𝕏 𝕆𝔽 𝔹𝕃𝔸ℂ𝕂 ℚ𝕌𝔸ℝ𝕋ℤ, 𝕁𝕌𝔻𝔾𝔼 𝕄𝕐 𝕍𝕆𝕎!",
      "𝕤𝕡𝕙𝕚𝕟𝕩 𝕠𝕗 𝕓𝕝𝕒𝕔𝕜 𝕢𝕦𝕒𝕣𝕥𝕫, 𝕛𝕦𝕕𝕘𝕖 𝕞𝕪 𝕧𝕠𝕨!",
      "ΖΧΚΝΔΗΡΨΩΥΠΕΘΙΤΣΓΑΟΞ∇ΦΒϴΜΛ",
      "υπ∂ϱϰβφεδϕοιρλϑςκνχξηωζμσατγϵϖψθ",
      "𝟛.𝟙𝟜𝟙𝟝𝟡𝟚𝟞𝟝𝟛𝟝𝟠𝟡𝟟𝟡𝟛𝟚𝟛𝟠𝟜𝟞𝟚𝟞𝟜𝟛𝟛𝟠𝟛𝟚𝟟𝟡𝟝𝟘",
    );
  });

  it("ScriptBold (bbcc)", function () {
    testFont(
      "bbcc",
      "𝓢𝓟𝓗𝓘𝓝𝓧 𝓞𝓕 𝓑𝓛𝓐𝓒𝓚 𝓠𝓤𝓐𝓡𝓣𝓩, 𝓙𝓤𝓓𝓖𝓔 𝓜𝓨 𝓥𝓞𝓦!",
      "𝓼𝓹𝓱𝓲𝓷𝔁 𝓸𝓯 𝓫𝓵𝓪𝓬𝓴 𝓺𝓾𝓪𝓻𝓽𝔃, 𝓳𝓾𝓭𝓰𝓮 𝓶𝔂 𝓿𝓸𝔀!",
      "ΖΧΚΝΔΗΡΨΩΥΠΕΘΙΤΣΓΑΟΞ∇ΦΒϴΜΛ",
      "υπ∂ϱϰβφεδϕοιρλϑςκνχξηωζμσατγϵϖψθ",
      "3.14159265358979323846264338327950",
    );
  });

  it("FrakturBold (bbfr)", function () {
    testFont(
      "bbfr",
      "𝕾𝕻𝕳𝕴𝕹𝖃 𝕺𝕱 𝕭𝕷𝕬𝕮𝕶 𝕼𝖀𝕬𝕽𝕿𝖅, 𝕵𝖀𝕯𝕲𝕰 𝕸𝖄 𝖁𝕺𝖂!",
      "𝖘𝖕𝖍𝖎𝖓𝖝 𝖔𝖋 𝖇𝖑𝖆𝖈𝖐 𝖖𝖚𝖆𝖗𝖙𝖟, 𝖏𝖚𝖉𝖌𝖊 𝖒𝖞 𝖛𝖔𝖜!",
      "ΖΧΚΝΔΗΡΨΩΥΠΕΘΙΤΣΓΑΟΞ∇ΦΒϴΜΛ",
      "υπ∂ϱϰβφεδϕοιρλϑςκνχξηωζμσατγϵϖψθ",
      "3.14159265358979323846264338327950",
    );
  });

  it("SerifBoldItalic (bbit)", function () {
    testFont(
      "bbit",
      "𝑺𝑷𝑯𝑰𝑵𝑿 𝑶𝑭 𝑩𝑳𝑨𝑪𝑲 𝑸𝑼𝑨𝑹𝑻𝒁, 𝑱𝑼𝑫𝑮𝑬 𝑴𝒀 𝑽𝑶𝑾!",
      "𝒔𝒑𝒉𝒊𝒏𝒙 𝒐𝒇 𝒃𝒍𝒂𝒄𝒌 𝒒𝒖𝒂𝒓𝒕𝒛, 𝒋𝒖𝒅𝒈𝒆 𝒎𝒚 𝒗𝒐𝒘!",
      "𝜡𝜲𝜥𝜨𝜟𝜢𝜬𝜳𝜴𝜰𝜫𝜠𝜣𝜤𝜯𝜮𝜞𝜜𝜪𝜩𝜵𝜱𝜝𝜭𝜧𝜦",
      "𝝊𝝅𝝏𝝔𝝒𝜷𝝋𝜺𝜹𝝓𝝄𝜾𝝆𝝀𝝑𝝇𝜿𝝂𝝌𝝃𝜼𝝎𝜻𝝁𝝈𝜶𝝉𝜸𝝐𝝕𝝍𝜽",
      "3.14159265358979323846264338327950",
    );
  });

  it("SansBold (bbsf)", function () {
    testFont(
      "bbsf",
      "𝗦𝗣𝗛𝗜𝗡𝗫 𝗢𝗙 𝗕𝗟𝗔𝗖𝗞 𝗤𝗨𝗔𝗥𝗧𝗭, 𝗝𝗨𝗗𝗚𝗘 𝗠𝗬 𝗩𝗢𝗪!",
      "𝘀𝗽𝗵𝗶𝗻𝘅 𝗼𝗳 𝗯𝗹𝗮𝗰𝗸 𝗾𝘂𝗮𝗿𝘁𝘇, 𝗷𝘂𝗱𝗴𝗲 𝗺𝘆 𝘃𝗼𝘄!",
      "𝝛𝝬𝝟𝝢𝝙𝝜𝝦𝝭𝝮𝝪𝝥𝝚𝝝𝝞𝝩𝝨𝝘𝝖𝝤𝝣𝝯𝝫𝝗𝝧𝝡𝝠",
      "𝞄𝝿𝞉𝞎𝞌𝝱𝞅𝝴𝝳𝞍𝝾𝝸𝞀𝝺𝞋𝞁𝝹𝝼𝞆𝝽𝝶𝞈𝝵𝝻𝞂𝝰𝞃𝝲𝞊𝞏𝞇𝝷",
      "𝟯.𝟭𝟰𝟭𝟱𝟵𝟮𝟲𝟱𝟯𝟱𝟴𝟵𝟳𝟵𝟯𝟮𝟯𝟴𝟰𝟲𝟮𝟲𝟰𝟯𝟯𝟴𝟯𝟮𝟳𝟵𝟱𝟬",
    );
  });

  it("SansBoldItalic (bbsfit)", function () {
    testFont(
      "bbsfit",
      "𝙎𝙋𝙃𝙄𝙉𝙓 𝙊𝙁 𝘽𝙇𝘼𝘾𝙆 𝙌𝙐𝘼𝙍𝙏𝙕, 𝙅𝙐𝘿𝙂𝙀 𝙈𝙔 𝙑𝙊𝙒!",
      "𝙨𝙥𝙝𝙞𝙣𝙭 𝙤𝙛 𝙗𝙡𝙖𝙘𝙠 𝙦𝙪𝙖𝙧𝙩𝙯, 𝙟𝙪𝙙𝙜𝙚 𝙢𝙮 𝙫𝙤𝙬!",
      "𝞕𝞦𝞙𝞜𝞓𝞖𝞠𝞧𝞨𝞤𝞟𝞔𝞗𝞘𝞣𝞢𝞒𝞐𝞞𝞝𝞩𝞥𝞑𝞡𝞛𝞚",
      "𝞾𝞹𝟃𝟈𝟆𝞫𝞿𝞮𝞭𝟇𝞸𝞲𝞺𝞴𝟅𝞻𝞳𝞶𝟀𝞷𝞰𝟂𝞯𝞵𝞼𝞪𝞽𝞬𝟄𝟉𝟁𝞱",
      "3.14159265358979323846264338327950",
    );
  });

  it("ScriptNormal (cc)", function () {
    testFont(
      "cc",
      "𝒮𝒫ℋℐ𝒩𝒳 𝒪ℱ ℬℒ𝒜𝒞𝒦 𝒬𝒰𝒜ℛ𝒯𝒵, 𝒥𝒰𝒟𝒢ℰ ℳ𝒴 𝒱𝒪𝒲!",
      "𝓈𝓅𝒽𝒾𝓃𝓍 ℴ𝒻 𝒷𝓁𝒶𝒸𝓀 𝓆𝓊𝒶𝓇𝓉𝓏, 𝒿𝓊𝒹ℊℯ 𝓂𝓎 𝓋ℴ𝓌!",
      "ΖΧΚΝΔΗΡΨΩΥΠΕΘΙΤΣΓΑΟΞ∇ΦΒϴΜΛ",
      "υπ∂ϱϰβφεδϕοιρλϑςκνχξηωζμσατγϵϖψθ",
      "3.14159265358979323846264338327950",
    );
  });

  it("FrakturNormal (fr)", function () {
    testFont(
      "fr",
      "𝔖𝔓ℌℑ𝔑𝔛 𝔒𝔉 𝔅𝔏𝔄ℭ𝔎 𝔔𝔘𝔄ℜ𝔗ℨ, 𝔍𝔘𝔇𝔊𝔈 𝔐𝔜 𝔙𝔒𝔚!",
      "𝔰𝔭𝔥𝔦𝔫𝔵 𝔬𝔣 𝔟𝔩𝔞𝔠𝔨 𝔮𝔲𝔞𝔯𝔱𝔷, 𝔧𝔲𝔡𝔤𝔢 𝔪𝔶 𝔳𝔬𝔴!",
      "ΖΧΚΝΔΗΡΨΩΥΠΕΘΙΤΣΓΑΟΞ∇ΦΒϴΜΛ",
      "υπ∂ϱϰβφεδϕοιρλϑςκνχξηωζμσατγϵϖψθ",
      "3.14159265358979323846264338327950",
    );
  });

  it("SerifItalic (italic)", function () {
    testFont(
      "italic",
      "𝑆𝑃𝐻𝐼𝑁𝑋 𝑂𝐹 𝐵𝐿𝐴𝐶𝐾 𝑄𝑈𝐴𝑅𝑇𝑍, 𝐽𝑈𝐷𝐺𝐸 𝑀𝑌 𝑉𝑂𝑊!",
      "𝑠𝑝ℎ𝑖𝑛𝑥 𝑜𝑓 𝑏𝑙𝑎𝑐𝑘 𝑞𝑢𝑎𝑟𝑡𝑧, 𝑗𝑢𝑑𝑔𝑒 𝑚𝑦 𝑣𝑜𝑤!",
      "𝛧𝛸𝛫𝛮𝛥𝛨𝛲𝛹𝛺𝛶𝛱𝛦𝛩𝛪𝛵𝛴𝛤𝛢𝛰𝛯𝛻𝛷𝛣𝛳𝛭𝛬",
      "𝜐𝜋𝜕𝜚𝜘𝛽𝜑𝜀𝛿𝜙𝜊𝜄𝜌𝜆𝜗𝜍𝜅𝜈𝜒𝜉𝜂𝜔𝜁𝜇𝜎𝛼𝜏𝛾𝜖𝜛𝜓𝜃",
      "3.14159265358979323846264338327950",
    );
  });

  it("SansNormal (sf)", function () {
    testFont(
      "sf",
      "𝖲𝖯𝖧𝖨𝖭𝖷 𝖮𝖥 𝖡𝖫𝖠𝖢𝖪 𝖰𝖴𝖠𝖱𝖳𝖹, 𝖩𝖴𝖣𝖦𝖤 𝖬𝖸 𝖵𝖮𝖶!",
      "𝗌𝗉𝗁𝗂𝗇𝗑 𝗈𝖿 𝖻𝗅𝖺𝖼𝗄 𝗊𝗎𝖺𝗋𝗍𝗓, 𝗃𝗎𝖽𝗀𝖾 𝗆𝗒 𝗏𝗈𝗐!",
      "ΖΧΚΝΔΗΡΨΩΥΠΕΘΙΤΣΓΑΟΞ∇ΦΒϴΜΛ",
      "υπ∂ϱϰβφεδϕοιρλϑςκνχξηωζμσατγϵϖψθ",
      "𝟥.𝟣𝟦𝟣𝟧𝟫𝟤𝟨𝟧𝟥𝟧𝟪𝟫𝟩𝟫𝟥𝟤𝟥𝟪𝟦𝟨𝟤𝟨𝟦𝟥𝟥𝟪𝟥𝟤𝟩𝟫𝟧𝟢",
    );
  });

  it("SansItalic (sfit)", function () {
    testFont(
      "sfit",
      "𝘚𝘗𝘏𝘐𝘕𝘟 𝘖𝘍 𝘉𝘓𝘈𝘊𝘒 𝘘𝘜𝘈𝘙𝘛𝘡, 𝘑𝘜𝘋𝘎𝘌 𝘔𝘠 𝘝𝘖𝘞!",
      "𝘴𝘱𝘩𝘪𝘯𝘹 𝘰𝘧 𝘣𝘭𝘢𝘤𝘬 𝘲𝘶𝘢𝘳𝘵𝘻, 𝘫𝘶𝘥𝘨𝘦 𝘮𝘺 𝘷𝘰𝘸!",
      "ΖΧΚΝΔΗΡΨΩΥΠΕΘΙΤΣΓΑΟΞ∇ΦΒϴΜΛ",
      "υπ∂ϱϰβφεδϕοιρλϑςκνχξηωζμσατγϵϖψθ",
      "3.14159265358979323846264338327950",
    );
  });

  it("Monospace (tt)", function () {
    testFont(
      "tt",
      "𝚂𝙿𝙷𝙸𝙽𝚇 𝙾𝙵 𝙱𝙻𝙰𝙲𝙺 𝚀𝚄𝙰𝚁𝚃𝚉, 𝙹𝚄𝙳𝙶𝙴 𝙼𝚈 𝚅𝙾𝚆!",
      "𝚜𝚙𝚑𝚒𝚗𝚡 𝚘𝚏 𝚋𝚕𝚊𝚌𝚔 𝚚𝚞𝚊𝚛𝚝𝚣, 𝚓𝚞𝚍𝚐𝚎 𝚖𝚢 𝚟𝚘𝚠!",
      "ΖΧΚΝΔΗΡΨΩΥΠΕΘΙΤΣΓΑΟΞ∇ΦΒϴΜΛ",
      "υπ∂ϱϰβφεδϕοιρλϑςκνχξηωζμσατγϵϖψθ",
      "𝟹.𝟷𝟺𝟷𝟻𝟿𝟸𝟼𝟻𝟹𝟻𝟾𝟿𝟽𝟿𝟹𝟸𝟹𝟾𝟺𝟼𝟸𝟼𝟺𝟹𝟹𝟾𝟹𝟸𝟽𝟿𝟻𝟶",
    );
  });

  function testFont(
    font: FontName,
    ul: string,
    ll: string,
    ug: string,
    lg: string,
    di: string,
  ) {
    expect(formatText(font, ULATIN)).toEqual(ul);
    expect(formatText(font, LLATIN)).toEqual(ll);
    expect(formatText(font, UGREEK)).toEqual(ug);
    expect(formatText(font, LGREEK)).toEqual(lg);
    expect(formatText(font, DIGIT)).toEqual(di);
  }
});
